SunCity/src/InformationRegisters/КассоваяДисциплинаВыемкиПриЗакрытииСмены/КассоваяДисциплинаВыемкиПриЗакрытииСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КассоваяДисциплинаВыемкиПриЗакрытииСмены</name>
  <resources>
    <name>ТипВыемкиПриЗакрытииСмены</name>
    <type>
      <types>EnumRef.ТипыВыемкиПриЗакрытииСмены</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяСуммаРазмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/InformationRegisters/КассоваяДисциплинаВыемкиПриЗакрытииСмены/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") Тогда
		ТекстЗаголовка = НСтр("ru = 'Типы выемки при закрытии смены'");
		Если Параметры.Отбор.Свойство("Магазин") И ТипЗнч(Параметры.Отбор.Магазин) = Тип("СправочникСсылка.Магазины") Тогда
			Элементы.Магазин.Видимость = Ложь;
			ТекстЗаголовка = ТекстЗаголовка + ": " + Строка(Параметры.Отбор.Магазин);
		КонецЕсли;
		Если Параметры.Отбор.Свойство("Организация") И ТипЗнч(Параметры.Отбор.Организация) = Тип("СправочникСсылка.Организации") Тогда
			Элементы.Организация.Видимость = Ложь;
			ТекстЗаголовка = ТекстЗаголовка + " (" + Строка(Параметры.Отбор.Организация) + ")";
		КонецЕсли;
		
		АвтоЗаголовок = Ложь;
		Заголовок     = ТекстЗаголовка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
       
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.КассоваяДисциплинаВыемкиПриЗакрытииСмены.Форма.ФормаСписка.Открытие");

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.КассоваяДисциплинаВыемкиПриЗакрытииСмены.Форма.ФормаЗаписи.Открытие");

КонецПроцедуры

#КонецОбласти
